iarsystems/ewarm-toshiba-example-projects/TMPM4NN/Libraries/startup/startup_TMPM4NN.s
                PUBWEAK INTI2S0SOERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S0SOERR_IRQHandler
                B       INTI2S0SOERR_IRQHandler

                PUBWEAK INTI2S1SI_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SI_IRQHandler
                B       INTI2S1SI_IRQHandler

                PUBWEAK INTI2S1SIERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SIERR_IRQHandler
                B       INTI2S1SIERR_IRQHandler

                PUBWEAK INTI2S1SO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SO_IRQHandler
                B       INTI2S1SO_IRQHandler

                PUBWEAK INTI2S1SOERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTI2S1SOERR_IRQHandler
                B       INTI2S1SOERR_IRQHandler

                PUBWEAK INTFIR0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFIR0_IRQHandler
                B       INTFIR0_IRQHandler

                PUBWEAK INTTSSI0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0RX_IRQHandler
                B       INTTSSI0RX_IRQHandler

                PUBWEAK INTTSSI0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0TX_IRQHandler
                B       INTTSSI0TX_IRQHandler

                PUBWEAK INTTSSI0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0ERR_IRQHandler
                B       INTTSSI0ERR_IRQHandler

                PUBWEAK INTEMA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEMA_IRQHandler
                B       INTEMA_IRQHandler

                PUBWEAK INTEMAMP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEMAMP_IRQHandler
                B       INTEMAMP_IRQHandler

                PUBWEAK INTCANARXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANARXD_IRQHandler
                B       INTCANARXD_IRQHandler

                PUBWEAK INTCANATXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANATXD_IRQHandler
                B       INTCANATXD_IRQHandler

                PUBWEAK INTCANAGLB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANAGLB_IRQHandler
                B       INTCANAGLB_IRQHandler

                PUBWEAK INTCANBRXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBRXD_IRQHandler
                B       INTCANBRXD_IRQHandler

                PUBWEAK INTCANBTXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBTXD_IRQHandler
                B       INTCANBTXD_IRQHandler

                PUBWEAK INTCANBGLB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBGLB_IRQHandler
                B       INTCANBGLB_IRQHandler

                PUBWEAK INTUSBOTGA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGA_IRQHandler
                B       INTUSBOTGA_IRQHandler

                PUBWEAK INTUSBOTGAWK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGAWK_IRQHandler
                B       INTUSBOTGAWK_IRQHandler

                PUBWEAK INTT32A14_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_A_IRQHandler
                B       INTT32A14_A_IRQHandler

                PUBWEAK INTT32A14_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_B_IRQHandler
                B       INTT32A14_B_IRQHandler

                PUBWEAK INTT32A14_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_CT_IRQHandler
                B       INTT32A14_CT_IRQHandler

                PUBWEAK INTT32A15_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_A_IRQHandler
                B       INTT32A15_A_IRQHandler

                PUBWEAK INTT32A15_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_B_IRQHandler
                B       INTT32A15_B_IRQHandler

                PUBWEAK INTT32A15_C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_C_IRQHandler
                B       INTT32A15_C_IRQHandler

                PUBWEAK INTMDMAADISR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAADISR_IRQHandler
                B       INTMDMAADISR_IRQHandler

                END
